{"loginsystem": {"description": "**چگونه برای خود سیستم لاگین و رجیستر در سرور راه بندازیم؟**\n\nروش های متعددی برای اینکار هست اما بیشتر سرور های کرکی از پلاگین (AuthMe) برای این سیستم استفاده می کنند.\nشما با قرار دادن این پلاگین در سرورتون می تونید این سیستم رو به سرورتون اضافه کنید.\n\n 🔗 صفحه ی پلاگین:\nhttps://www.spigotmc.org/resources/authmereloaded.6269/", "by": "Dead_Light"}, "viaversion": {"description": "<:3419_added:771442650611187742> چگونه سرور خودمون رو مولتی ورژن کنیم ؟ یعنی از ورژن های مختلف بتونند وارد سرور ما بشن؟\n\nبرای این کار شما می باست از پلاگین معروف (viaversion) استفاده کنید. \n\nلینک صفحه ی پلاگین:<:spigot:771822526389157908> \nhttps://www.spigotmc.org/resources/viaversion.19254/\n\nلینک آموزش نصب این پلاگین:\nhttps://aparat.com/v/IkDRc", "by": "Dead_Light"}, "geysermc": {"description": "<:3419_added:771442650611187742> تا حالا فکر این بودید که می تونید با نسخه بدراک گوشی یا پلی استیشن یا ایکس باکس وارد سرور جاوا ادیشن بشید؟\n\n<:4407_New_verified:771442682782154762> اینجاس که GeyserMC شاهکار کرده!\n\nGeyserMC یه پروژه ی جالبیه که این امکان رو به شما می ده که هم به سرور پرمیوم هم سرور کرکی راحت جوین شید!\n\nGeyserMC به چند صورت مثل پلاگین اسپیگات یا پلاگین بانجی کورد یا به صورت جدا قابل اجراس!\n\n<:6520_devNew:771442662901284864> لینک سایت این پروژه\nhttps://geysermc.org/\n\nآموزش بزودی قرار داده خواهد شد!", "by": "Buddy"}, "nullexception": {"description": "Error nullexceptionpointer \n\nدر پلاگین نویسی ممکن هست خیلی مشاهده بشه، گرچه داخل خود بازی هم قابل مشاهده در بعضی از موارد هست.\n\nاین ارور فقط و فقط می تونه 1 معنی داخل پلاگین نویسی داشته باشه و به معنی این هست که شما چیزی رو که میخواید رو به دست نیاوردید که دارید باهاش کاری رو انجام میدید. برای مثل شما فکر می کنید یک آبجکت رو مثل لوکیشن رو دریافت کردید اما در واقعیت وقتی سرور پیدا نمی کنه و یا شما درست پیداش نمی کنید، پلاگین به جاش نال میزاره و این به این معناست که پیدا نشده و شما دارید با نال کاری رو انجام میدید.\n\nمعمولا این ارور به خاطر مشکل پلاگین دیده میشه و در کمتر شرایطی علت این ارور کاربر پلاگین هست.", "by": "Dead_Light"}, "freehosting": {"description": "در مجموع 3 سایت معروف برای ارایه سرور های ماین کرافتی هستند.\n\n📌 Server.pro و aternos.org\n\nserver.pro:\nسایت خوبی هست ولی برای بازی کردن در سرور هاش میبایست فیلتر شکن استفاده کنید.\n\naternos.org:\nبر خلاف سایت بالایی، این هاستینگ نیاز به فیلتر شکن برای ورود به سرور هاش نداره.\n\nهمه ای این سایت ها فقط برای بازی کردن با دوستانتون خوب هست و در همین حد و نه بیشتر.\n\nسایت های دیگر که سرویس سرور ماین کرافت رایگان ارایه میدهند (این لیست آپدیت میشود):\n\nfreemcserver.net", "by": "Dead_Light"}, "highenchant": {"description": "<:3419_added:771442650611187742> میخوای انتچنت های لول بالا مثل VIII یا X بزاری رو هر وسیله ای؟\n\n<:8589_ImgurInsightful:771442731804262470> خب اول نیاز به پلاگین EssentialsX داری \n\n<:9207_thnkng:771442429265707019> اصلا EssentialsX چیه دیگه؟ \n<:4407_New_verified:771442682782154762> یه پلاگینه که چیز های ابتدایی رو به سرورت اضافه میکنه مثلا /home , /fly و ...\n\n<:7305_tabs:771442694622937189> بعد از اینکه پلاگین رو ریختی رو سرورت یا باید سرور رو ری-استارت کنی یا اینکه اگه پلاگمن رو سرورت ریختی میتونی با کامند \n/plugman load EssentialsX \nپلاگین رو فعال کنی\n\n<:4407_New_verified:771442682782154762> خب خب خب \nتا اینجایه کار که خسته نشدی؟ چون ۸۰% کار رو انجام دادی 😋 \n\n<:1739_CMD:771442636522651649> حالا برو تو محل \n(LocationServer)/plugins/EssentialsX/config.yml\nبعد دکمه (ویندوز + F) رو فشار بده تا قسمت جستجو برات باز شه \nبعد تو قسمت جستجو کلمه ی Unsafe-Enchant رو بنویس و روی دکمه ی Search یا Find بزن\nبعد قسمت Unsafe Enchant که پیدا شد جلوش نوشته False اون رو به True تغییر بده و حتما حتما فایل کانفیگ رو سیو کن\n\nحالا کامند Essentials Reload/ رو بزن \nبعد با ماین کرفت وارد سرور شو و هر ایتمی که میخای انچنت کنی بگیر دستت و کامند\n/Enchant (اسم انچنت) (لول انچنت به عدد) \nرو وارد کن\n\n حالا بازیکن و لذت ببر 😉 \nامیدوارم که خوشت اومده باشه 🥳", "by": "MoonWalker (Bye Ta Tabestoon)"}, "wronganswer": {"description": "#Don't_Give_A_Wrong_Answer_If_You_Don't_Know\n\nاگر جواب سوال رو به درستی نمیدونی، بهش جواب نده!\n\n- Dead_Light 1399", "by": "Dead_Light"}, "bungeecord": {"description": "بانجی کورد چیست؟\n-اگه شما دارای سرور های جدا از هم هستید و به فکر کانکت کردن این سرور ها به هم هستید، پروکسی بانجی کورد این قابلیت رو بهتون میده! شما میتونید با استفاده از پورت سرور هاتون سرور هاتون را به هم متصل کرده و خیالتون از این قضیه راحت شه.\n\nMore Information? https://spigotmc.org/wiki/bungeecord", "by": "Wylot"}, "hologram": {"description": "<:8589_ImgurInsightful:771442731804262470> چطور هولوگرام در سرور خود بزاریم؟\n\nبرای اینکار شما به پلاگین\nHolographic Displays\nنیاز دارید.\n\nلینک دانلود پلاگین:\nhttps://dev.bukkit.org/projects/holographic-displays\nآموزش کار با این پلاگین:\nhttps://aparat.com/v/baE3R", "by": "Dead_Light"}, "salam": {"description": "لطفا از گفتن کلمات و جملات:\n\nسلام - \nسلام میشه بهم کمک کنید؟ - \n کمک میخوام یکی بهم کمک کنه - \n\nیا هرچیزی که شبیه به این جملات باشه خودداری کنید. اگر کسی بتونه شما رو در اون زمان کمک کنه و یا اینکه بتونه جواب سوال شما رو بده، به شما کمک میکنه. فقط سلام کردم و سپس پرسیدن اینکه بهم کمک کنید اونم در چنلی که مخصوص کمک کردن ساخته شده کار احمقانه ای هست. مثل این میمونه که شما به یکی زنگ بزنی و سلام کنی و هیچی نگی.\n\nممنون", "by": "Dead_Light"}, "mention": {"description": "از منشن کردن افراد جدا خودداری کنید، هر موقع فردی جواب سوال شما رو بدونه و یا بخواد کمک بکنه جوابتون رو میده", "by": "Dead_Light"}, "griefprevention": {"description": "<:4407_New_verified:771442682782154762> - عمرا تاحالا نیم کلایم رو نشنیده باشید! حداقل خونتونو تاحالا یبار کلایم کردید\n1- شاید تو ذهنتون سوال به وحود اومده که چجوری این کلایم ایجاد میشه \n\n2- برای این کار پلاگین GriefPrevention این اجازه رو بهتون میده تا قابلیت کلایم رو به سرورتون ادد کنید!\n\nکافیه از من استفاده کنی و نام پلاگینو سرچ بزنی و بعد نصبش کنیو تمام !\nکلایم به سرورت ادد کردی!", "by": "Wylot"}, "powerranks": {"description": "🟩 پلاگین پاور رنکس پلاگینی برای ساختن رنک ها در سرور به خصوص اترنوس کار میره\n🟥 اگه سرور اترنوسی دارین استفاده از این پلاگین خیلی خوبه هم ویرایشش سادس و هم ساختن و مدریت کردن رنک ها\n🟥 ولی اگه سرور وی پی اسی دارین به نظر من از این پلاگین استفاده نکنین!\n-------------------------------------------------------------------\n🟨 بریم سراغ آموزش:\n🟦 1- برای ساختن رنک از دستور\n/pr createrank name\n❌ توجه از & برای رنگ زدن به نام رنک در این قسمت استفاده نکنین!\n🟧 2- برای حذف رنک از دستور\n/pr deleterank name\n🟪 3- برای اضافه کردن پرمیژن از دستور\n/pr addperm RankName Permission\n♦️ توجه کنین ممکنه بعضی از پرمیژن ها از لیست تبی که پلاگین ارائه میده نباشه مثل\nessentials\nبرای پیدا کردن پرم های این پلاگین باید به وب سایتت خودش یعنی\nhttps://essinfo.xeya.me/permissions.html\nمراجعه کنین و لیست تمامی پرمیژن ها رو به دست بیایین\n🟫 4- برای اینکه رنگ رنک رو تغییر بدیم از دستور\n/pr setprefix <rank_name> <new_prefix>\n⬜ 5- برای تنظیم کردن رنک کسی از دستور\n/pr setrank <player_name> <rank_name>\n-------------------------------------------------------------------\n<:4407_New_verified:771442682782154762> نکات اضافی:\n/pr setsuffix <rank_name> <new_suffix>\nبرای عوض کردن سافیکی رنک ( سافیکس پسوندی است که بعد نام پلیر میاد)\n/pr checkrank [player_name]\nبررسی رنک کسی\n/pr setchatcolor <rank_name> <color>\nعوض کردن رنگ چت رنکی\n/pr setnamecolor <rank_name> <color>\nعوض کردن نام پلیر رنک\n-------------------------------------------------------------------\n<:4407_New_verified:771442682782154762> شما می تونین از کامند زیر به GUI پلاگین دسترسی داشته باشین ...\n/pr gui", "by": "MNA"}, "dastband": {"description": "پلاگین دستبند:\n🖇️ برای استفاده از پلاگیت دستبند در سرورتون می تونین ازCuffEm استفاده کنین\n<:4407_New_verified:771442682782154762> خب نحوه استفاده از این پلاگین کاره سختی نیست فقط کافیه بعد از اینکه پلاگین رو ریختین از کامند زیر برای گرفتن دستبند استفاده کنین\n/cuffem:givecuffs [player]\nبعد از اون یه Blaze rodبهتون میده 🟦  که پیش فرق ایتمش هست و اگه دوست داشتین تغییر بدیت می تونین از کانفیگش ویرایش کنین\n🟨 برای استفاده از تکسچر دستبند می تونین با یه سرچ ریسورس پکس رو بدست بیارین و بریزین تو سرورتون\n<:4407_New_verified:771442682782154762> موفق و پیروز باشین\n✅", "by": "MNA"}, "chatcolor": {"description": "🟥 🟩 🟨 🟦\nبرای اینکه بتونیم در چت یا گفتگو رنگی بنویسیم به پلاگین essentials نیاز داریم\nاگه این پلاگین رو دارین کف=افیه با اضافه کردن & در اول پیام خود، متن پیامتون رو رنگی کنین.\nبعد علامت & اعداد 1 تا 9 و یا حروف a تا f را وارد کنین\nهمچنین می تونین از ایتالیک بولد اندرلاین و ... استفاده کنین\nعلامت های این حروف :‌ l m n و... می باشد\n----------------------------------------------------------------------------------------\nهمچنین برای اینکه در هولگرام ها متنی را انیمیشن رنگی بدهیم می تونیم از\n&u\nاستفاده کنیم\n💠 ➖  ➖  ➖  ➖  ➖  ➖  ➖ 💠 \nاطلاعات تکمیلی در\n``info colorcode``\n💠 ➖  ➖  ➖  ➖  ➖  ➖  ➖ 💠 \n🔗 Other Info||s|| :\n➖ info powerranks\n➖ info turnpvp", "by": "MNA"}, "notepad++": {"description": "<:7305_tabs:771442694622937189> یکی از ساده ترین محیط های برنامه نویسی زبان YAML که زبان ادیت فایل کانفیگ پلاگین های ماینکرافت به شمار میرود. NotePad++ هستش!\n\n<:9623_shinmuratriggered:771442589109977138> نوت پد ++ رم یوسیج کمتر و کاربرد های بهتر نسبت به Visual Studio روی ورق داره و روی همین ورق میتونیم بگیم بهترین ادیتور برای سرور های ماینکرافتی همین Notepad++ هستش !\n\n<:4407_New_verified:771442682782154762> اگه میخواهید تجربه کار با این محیط را داشته باشید از لینک زیر اقدام به دانلود کنید!\nhttps://notepad-plus-plus.org/", "by": "Wylot"}, "clearlag": {"description": "-info clearlag\n```آموزش کار با پلاگین clearlag```\nخب بریم سراغ آموزش:\n🟨 خب اول از همه پلاگین رو که ریختی به طور اتوماتیک پلاگین هر چند وقت یبار ایتم های روی زمین رو پاک می کنه!\n🟥 از جمله کار های دیگه این پلاگین استک کردن ایتم ها هست که روی زمین دراپ میشن و باعث رفع لگ میشه\n🟦 به طور اتوماتیک از پیام هایی که تو کانفیگش داره استفاده می کنه و شما می تونین پیام هایی که چاپ می کنه رو از کافیگ تغییر بدین\n🟩 از کامند ها زیر برای رفع لگ دستی هم می تونین استفاده کنین:\n> /lagg clear\n> /lagg area [redius]\n> /lagg help", "by": "MNA"}, "worldedit": {"description": "یکسری سازه های ماینکرفتی، بنایشان به صورت دستی زمان زیادی می برد و ممکن است سخت باشد! حتما در سرور ها هم دیده اید که لابی ها و سازه هایی به چه بزرگی می سازند. در واقع آنها این سازه ها را دستی نمی سازند؛ بلکه با یکسری پلاگین ها می سازند.\n یکی از معروف ترین پلاگین های بیلد، ورلد ادیت می باشد. شما با ورلد ادیت کار های زیادی می توانید انجام دهید. برای مثال: ساخت کُره، ساخت هرم و ... . \nهمچنین تمام دستور های ورلد ادیت با \"//\" شروع می شوند.\nنسخه های دیگری از ورلد ادیت هم وجود دارند که بهترین آن Fast Asynce WorldEdit می باشد. پس بهتر است همیشه از این نسخه از WorldEdit استفاده نمایید.", "by": "⌞𝟎𝟕𝒂𝒍𝒊𝟕𝟎⌝"}, "colorcode": {"description": "<:New_verified:771442682782154762> کد های رنگی <:New_verified:771442682782154762>\n💠 ➖  ➖  ➖  ➖  ➖  ➖  ➖ 💠\n🔴 🟢 🔵 تو این تاپیک قراره درباره اینکه چطور متن رنگی بفرستیم صحبت کنیم🔴 🟢 🔵\n🟦 خب قبل از همه حتما چک کنین که پلاگینی برای چت رنگی و یا هر چیز دیگه ای تو سرورتون داشته باشه اگه essentials رو دارین کافیه\n🟩 خب برای نوشتن رنگی اول هر متن یا کلمه یک & میزاریم\n<:added:771442650611187742> بعد & رنگ مورد نظر رو وارد می کنیم لیست رنگ ها :\n> 🟩 سبز کم رنگ : a&\n> 🟦 آبی کم رنگ : b&\n> 🟥 قرمز کم رنگ :‌c&\n> 🟪 صورتی کم رنگ : d&\n> 🟨 زرد : e&\n> ⬜ سفید : f&\n> ⬛ مشکی : 0&\n> 🔷 آبی پر رنگ :‌ 1&\n> 🟢 سبز پر رنگ : 2&\n> 🔹 آبی آسمانی : 3&\n> ♦️ قرمز پر رنگ : 4&\n> 🟣 بنفش : 5&\n> 🔶 نارنجی : 6&\n> 🔳 طوسی : 7&\n> 🔳 طوسی پر رنگ : 8&\n> 🔘 آبی : 9&\n>  همچنین از کد های :\n> &m\n> &n\n> &k\n> &u\n> &l\n>  برای حالت دادن به متن ( بولد اندرلاین مجیک ... ) استفاده میشه\n>  نکته: u& فقط بر روی بعضی چیز ها مثل هولگرام ها میشه زد که باعث انیمیشن رنگی متن میشه ! ⚠️ \n💠 ➖  ➖  ➖  ➖  ➖  ➖  ➖ 💠 \nاطلاعات تکمیلی در\n``info colorcode``\n💠 ➖  ➖  ➖  ➖  ➖  ➖  ➖ 💠 \n🔗 Other Infos :\n➖ info powerranks\n➖ info turnpvp", "by": "MNA"}, "titlemanager": {"description": "این پلاگین یکی از بهترین پلاگین های ساخته شده برای Scoreboard و TabList هست اما  در سرور های بزرگ از این پلاگین استفاده نمیکنن! چرا؟\nچون پلاگین های دیگه ای هستند که باگ های کمتری دارند و ویژگی ها و انیمیشن های بیشتر میتونیم رو نوشته ها اعمال کنیم. اما خب این پلاگین قابلیت های بخصوص خودشو داره.\nقابلیت های این پلاگین :\n- اضافه کردن تب لیست\n- اضافه کردن اسکور برد\n- اضافه کردن تایتل ورود\nدستور ها و کامند ها :\n- برای ریلود کردن این پلاگین از دستور زیر استفاده میکنیم\n/tm reload\nکانفیگ :\nهمه چیز را میتونید در کانفیگ این پلاگین تغییر بدید.\n=---------------------------------------------------=\nاین پلاگین برای سرور های اترنوس خوبه ولی برای سرور های وی پی اس و...\n پلاگین های بهتری هستند!.\n=---------------------------------------------------=", "by": "Seyyed"}, "help": {"description": "راهنمای استفاده از بات\n-info [تاپیک]\n-search [نام پلاگین]\n-thx تشکر کردن زیبا", "by": "⌞𝟎𝟕𝒂𝒍𝒊𝟕𝟎⌝"}, "luckperms": {"description": "لاکپرمز یکی از بهترین پلاگین ها در زمینه مدیریت رنک های سرور است. با لاکپرمز می توانید رنک بسازید، به آنها پرفیکس بدهید، به فردی رنک بدهید، پرمیشن های رنک را تنظیم کنید و ... . اخیرا لاکپرمز قابلیت جدیدی هم ایجاد کرده است که با آن می توان پرمیشن ها و یکسری چیز های رنک ها را در محیطی گرافیکی تحت وب تنظیم کنید! برای استفاده از محیط گرافیکی لاکپرمز باید از این کامند استفاده کرد: /lp editor. این باعث می شود افراد تازه کار در مدیریت و تنظیم رنک ها دچار سردرگمی نشوند! همچنین پلاگین لاکپرمز به تنهایی کافی نمی باشد و باید یکسری پلاگین های دیگر مرتبط با لاکپرمز را هم از قبیل LPC و LuckTab به سرورتان اضافه کنید.", "by": "⌞𝟎𝟕𝒂𝒍𝒊𝟕𝟎⌝"}, "skinrestorer": {"description": "اسکین ری استورر پلاگینی برای سرور های کرکی است که با آن افرادی که اکانت پرمیوم ندارند می توانند از اسکین های افرادی که اکانت پرمیوم دارند استفاده کنند. مثلا شما اکانت پرمیوم ندارید و می خواهید از اسکین بنده که اکانت پرمیوم دارم، استفاده کنید. یوزرنیم اکانت من Mr_07ali70 می باشد. پس باید یکی از این دستورات را اجرا نمایید: /skin set Mr_07ali70 یا /skin Mr_07ali70", "by": "⌞𝟎𝟕𝒂𝒍𝒊𝟕𝟎⌝"}, "vault": {"description": "💰  پلاگین vault | پول\n`----------------------`\n<:4407_New_verified:771442682782154762>  پلاگین vault پلاگینی هست برای سیستم پول در سرورتون !\n🪄  خوبی این پلاگین نسبت به پلاگین های دیگه اینه که اکتر پلاگین هایی که نیاز به سیستم پولی رو دارن این پلاگین ساپورت می کنن\n💡 در واقع میشه گفت تقریبا همه سرور ها سیستم پولیشون با این پلاگین هست !\n❔  اما چطور می تونین سیستم پول رو مدریت کنین و برای بازیکن ها پول بدین و کسر کنین\n`----------------------`\nلیست دستورات | کامند ها :\n💵 ** /eco**\n> give  [PlayerName] [Megdar] **دادن مقداری پول به بازیکن **\n> set [PlayerName] [megdar] ** تایین مقدار پول بازیکن **\n> help  ** دیدن تمامی لیست دستورات **", "by": "MNA"}, "minecraft": {"description": "ماینکرفت یک بازی سندباکس و جهان باز مستقل است که توسط موجانگ AB ساخته شده و توسط همین استودیو برای کامپیوتر و موبایل منتشر شده‌است. نسخه پی سی بازی به صورت عمومی در ۱۷ می ۲۰۰۹ با عنوان نسخه آلفا منتشر شد و بعد از آپدیت‌های پیاپی به عنوان نسخه اصلی و نهایی در ۱۸ نوامبر ۲۰۱۱ عرضه شد. \n\nتاریخ نخستین انتشار: ۷ اکتبر ۲۰۱۱\n\nطراحان: مارکوس پرسون، ینس برگنستن\n\nپلتفرم‌ها: سکوی جاوا، نینتندو سوئیچ، پلی‌استیشن ۴، اکس‌باکس وان، اندروید، مایکروسافت ویندوز، آی‌اواس، بیشتر\n\nجوایز: جایزهٔ بازی‌های رایانه‌ای بفتا برای بهترین بازی خانوادگی و اجتماعی، جایزهٔ ویژهٔ بازی‌های رایانه‌ای بفتا، بیشتر\n\nبرنامه‌نویسان: موجنگ، Other Ocean Interactive، 4J Studios، اکس‌باکس گیم استودیوز", "by": "⌞𝟎𝟕𝒂𝒍𝒊𝟕𝟎⌝"}, "viabackward": {"description": "💯  از این پلاگین برای مولتی ورژن کردن سرور ها استفاده میشه!\nیعنی اگه شما ورژن سرورتون 1.16 باشه در صورتی که این پلاگین نصب کنین کسانی که زیر 1.16 هستند نیز می تونن به سرور شما بپیونددند !\n<a:Freemond:754611024082108477> از این پلاگین می تونین در سرور های مینیگیم و لابی مخصوصا استفاده کنین ولی برای سرور های سروایول توصیه نمیشه چون ممکنه بعضی گریفی هایی رو به وجود بیاره !\nلینک صفحه ی پلاگین: <:spigot:799016225048625162>\nhttps://www.spigotmc.org/resources/viabackwards.27448/", "by": "MNA"}, "multiverse-core": {"description": "یکی از بهترین و راحت ترین پلاگین های مدیریت دنیا های سرور، Multiverse Core می باشد. شما با این پلاگین می توانید دنیای ساف یا دنیای معمولی یا هر نوع دنیایی بسازید (بجز دنیای خالی یا همان Void که باید پلاگین VoidGenerator همراه با این پلاگین ریخته شود تا اینکار امکان پذیر باشد)، فایل دنیا هایتان را وارد سرورتان کنید و ... . همچنین تمام دستورات این پلاگین با mv شروع می شوند برای مثال: \n/mv tp <World>", "by": "⌞𝟎𝟕𝒂𝒍𝒊𝟕𝟎⌝"}, "edit": {"description": "ttt", "by": "⌞𝟎𝟕𝒂𝒍𝒊𝟕𝟎⌝"}, "mna": {"description": "لیست بعضی از تاپیک های MNA :\n👑 Powerranks\n💠 turnpvp\n⭐ DastBand\n⚔️ ColorCode\n♦️ ChatColor\n🔴 Ram\n🪙 Clear Lag\n🔋 Vault\n📂 connect\nVa koli chiz haye dige ✅", "by": "MNA"}, "<:baya1:816215824318464030>": {"description": "baya kn", "by": "Dead_Light"}, "create": {"description": "delete", "by": "⌞𝟎𝟕𝒂𝒍𝒊𝟕𝟎⌝"}, "ram": {"description": "🟦 تا حالا فکر کردین که رمی که برای سرور می خواین چقدر باشه ؟\n🟩 می خوای سرور ران کنی نمیدونی چقدر رم لازمته ؟ ✅  حتما این نوشته رو دنبال کن تا بگم \n.\n.\n🔰 خب اول از همه بگم که رم سرور بستگی داره که توی سرور قراره چه گیم مود هایی رو ران کنین\n➖ اگر سرور بدون بانجی می خواین ران کنین می تونین رم 8 یا 6 به کارتون بیاد \n➖ اگر سرور بانجی کوردی ران می کنین حتما حتما رم زیر 8 گیگ به هیچ وجه توصیه نمیشه\n🔰 دوم اینکه چقدر پلاگین و پلیر قراره بیاد\n➖ اگر رم سرورتون 10 در نظر بگیریم و حدود 50 پلاگین **TPS** سرور `سروایول` بر فرض مثال می تونه با 8 گیگ رم با 10 پلیر به راه بیوفته\n⚠️ نکته هم بگم که میزان لگ سرور بیشتر به قدرت سی پی یو سرور وابسته هست `رم فقط برای اطلاعات موقتی لازم میشه مثل اطلاعات چانک ولی سی پی یو برای پردازش اطلاعات`\n➖  سرور های PVP رم زیر 8 کلا نمیکشن و بیشتر به سی پی یو وابسته هستند \n⚠️ پی وی پی در سرور ها واقعا به سخت افزار قدرتمندی نیاز داره که بتونه بدون لگ ران بشه\n▫️ توصیه هایی از طرف بنده 😇 \n➖  رم بانجی: 512مگ\n➖  رم سروایول حداقل 8 گیگ\n➖  رم لابی حداقل 2 گیگ\n➖  رم اسکای بلاک ( بستگی داره به گلاگین ها ) حداقل 8 گیگ\n🎁", "by": "MNA"}, "cpu": {"description": "🟥 اگه دقت کرده باشین سرور ماینکرفت بیشتر از 1 کور سیپیو استفاده نمیکنه.\n🔴 برای همین سرورتون لگ میشه و باعث میشه TPS کم بشه.\n🔵 خوب. به یک ادیت ساده توی run.bat می توانید این مشکل رو رفع کنید :)\n🟢 باید فایل run.bat رو به این کد تغییر بدین.\n```bat\njava -XX:+UnlockExperimentalVMOptions -XX:ActiveProcessorCount=48 -Xms8086M -Xmx8086M -jar spigot.jar\npause\n```\nاین سرور الان از 4 کور استفاده میکنه 🥳 \nبای 😐", "by": "mrzt721010"}, "znpc": {"description": "این پلاگین رو شاید خیلیاتون نشناسید ولی بهترین پلاگین توی پلاگین های ان پی سی هست که قابلیت های زیادی داره\n\nخب حالا بریم سراغ آموزش\nبرای ساختن یه npc جدید :\n`/znpcs create -id (id) -skin (nameskin)  -name (name)`\n\nبرای اضافه کردن لاین :\n`/znpcs lines -id (id) -lines (line)`\nنکته : برای نوشتن لاین چند تا چیزو رعایت کنید؛ اینکه بجای فاصله (-) بزارید و برای لاین جدید فاصله بزارید\n\nبرای اضافه کردن کامند:\n`/znpcs action -id (id) -add/remove  SERVER/CONSOLE/COMMAND (cmd)`\nنکته : اگه سرورتون بانجی هست برای عوض کردن سرور از server استفاده کنید و بجای cmd اسم سرور رو بنویسید.", "by": "Seyyed68"}, "softwares": {"description": ".  سلام تو این تاپیک می خوایم انواع سرور ساز ها رو نام ببریم  . \n<:limmypinged:805793952954712064>  سرور ساز های پلاگینی :\nBukkit \nSpigot\nPaper\nPurper\nTuinity\nSpongeVanilla \nYatopia\nAkarin\nOrigami\n🧩  سرور ساز ها با مود: \nForge\nFabric\n💻  سرور ساز ها با مود و پلاگین:\nMagma\nSpongeForge\nMohist\nCatServer\nAeclight\n پروکسی ها :\nBungeecord\nWaterFall\nVelocty\nFlamecord\nTraventie\n🎲   تبدیل کننده ها:\nGeyserMC - Swithing on Java\nBigBrother - Swithing on PHP\nامید وارم از تاپیک خوشتون امده باشه", "by": "S4EeD_HD"}, "turnpvp": {"description": "👑 تا حالا فکر کردی چطور می تونی پی وی پی 1.8 رو بیاری روی ورژن های بالاتر؟!\n💠 ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ 💠 \nکافیه یکی از پلاگین های زیر رو نصب کنی:\n🟦 ⚔️ Combat Plus ⚔️\nLink:``https://ba2n.ir/CombatPlus`` **ترجیحی**\n🔸 ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ 🔸 \n🟩 AntiCooldown\nLink: ``https://ba2n.ir/OLDPVP`` \n🔸 ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ 🔸 \n🟥 ⭐ OLD PVP (1.8) - No Attack Cooldown, No Off-Hand ⭐\nLink: ``https://ba2n.ir/AntiCooldown``\n💠 ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ 💠 \n⚠️ `لینک ها جهت اشغال فضای کمتر کوتاه شده هستند `\n🔗 Other Info||s|| :\n➖ info powerranks\n➖ info chatcolor", "by": "MNA"}, "playerkits": {"description": "این پلاگین به جرأت جزو بهترین پلاگین های کیت هستش که همه ی امکاناتی که یه کیت میخواد رو داره!\n\nبریم سراغ کامند ها :\n\n-برای  درست کردن کیت جدید :\n`/kit create (name) `\n\n-برای ادیت کردن کیت در gui :\n`/kit edit (name) `\n\n-و برای  ریلود کردن :\n`/kit reload`\n\n**کانفیگش هم صفر تا صد میتونید تغییر بدید! **", "by": "Seyyed68"}, "connect": {"description": "💠➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ ➖ 💠\n\n🔰 ``چطوری می تونیم دوستامون رو به سرور روی کامپیوتر خود وصل کنیم؟``\n\n\n``مرحله اول``\n\n> برای این کار لازم هست که در مرحله اول باید **ایپی** خودتون رو به دست بیارین...\n> 🔴 راه های مختلفی برای این کار است ساده ترین راه توی مرورگر خود این عبارت رو جستجو می کنید: ``whats my ip address``\n\n\n``مرحله دوم``\n\n> پورت سرور خودتون رو ذخیره می کنید\n> 🟢 اگه در فایل سرور . پراپرتیز به ``server port `` دست نزده باشید به صورت پیشفرض ***25565*** هست اگه از بانجی کورد استفاده می کنید از کانفیگ فایل ان پورت خودتون رو ذخیره می کنید.\n\n``مرحله سوم``\n\n> ایپی و پورت خودتون رو به صورت `` ip:port `` به دوستاتون میدید \n> 🔵 مثال: 127.0.0.1:25565\n\n``مرحله +``\n\n> اگه دوستاتون به هر دلیل نتونست به سرور وصل بشه کافی هست که فایر وال ویندوز خودتون رو خاموش کنید و نتورک و کامپیوتر خود را در حالت public قرار میدید \n> ⚠️ اگه از انتی ویروس ها استفاده می کنید تنظیمات رو از انجا هم باید اعمال کنید\n\n``نکته``\n⚠️ ساختن سرور در روی کامپیوتر خود علاوه بر تحدید امنیتی و هک شدن داره \n➖ ** ممکنه حتی باعث سوختن قطعاتی از کامپیوتر خودتون هم بشه **\n⚠️ ساخت سرور بر روی کامپیوتر شخصی خود به هیچ وجه توصیه نمیشه هر گونه اتفاق ممکنه بیوفته", "by": "MNA"}, "google": {"description": "زندگی خالی نیست، خدا هست، گوگل هست، سرچ کردن هست.", "by": "Dead_Light"}, "scoreboard": {"description": "پلاگین های زیادی براش نوشته شده ولی پیشنهاد من این دوتاس :\n\n**- QuickBoard**\n**- SimpleScore**\n\nدوتاشون از تو کانفیگ میتونین متناشونو تغییر بدین ولی خب پلاگین دوم لگ ها و باگ های کمتری داره و امکانات بیشتری داره !\n\nبای 😐", "by": "Seyyed68"}, "vote": {"description": "شما با رای دادن می‌تونید رنک های مختلفی در سرور دریافت کنید به طور اتوماتیک، لینک رای دادن به سرور ماین هک:\n\nhttps://discordfa.com/servers/771435036468838451", "by": "Dead_Light"}, "<@!666939372897042464>": {"description": "<@!666939372897042464> کیست؟\nاو یک نوب بینهایت است که باید لفت بدهد\nحالا که تگ شدی لفت بده بدو بدو منتظریم\nhttps://media.discordapp.net/attachments/801059688359526470/802161352918433822/image0.gif", "by": "mrzt721010"}, "simplejoinmessages": {"description": "» SimpleJoinMessages\nدیدید که وقتی وارد سرور میشید یه پیام میده ؟ میخوای عوض کنیش؟\nاینکار با پلاگین های دیگه امکان داره ولی این پلاگین ساپورت پلاگین معروف PlaceHolderAPI\nداره!\nقابلیت ها:\n- Join Message\n- Quit Message\n- First Join Message\n- Staff Join Message [Prefix]\n- Staff Quit Message [Prefix[\n- No Permission Message (reload Command)\n- Reload Message\n- Player Join Motd Message\n- Staff Join Motd Message\n- Fully Customizable\n- PlaceHolderAPI Support\n\nلینک : https://www.spigotmc.org/resources/90822/", "by": "PmzHero"}, "pmzhero": {"description": "**Topics:**\n\n🔴  - SimpleJoinMessages \n🔴  - mcsoftwares", "by": "PmzHero"}, "reload": {"description": "Why Reload Is Bad :\nits bad dont use it\nor i will kill you", "by": "PmzHero"}, "anticheat": {"description": "💠 آنتی چیت ها انواع مختلفی دارن ولی چند تا از اون ها خوب هستن که تو این تاپیک بهتون معرفی می کنم\n\n-» AAC4 & AAC5\nاین آنتی چیت در واقع برای همه کارها مناسب هست و تقریبا میشه گفت تمام چیت ها رو پیدا میکنه\nولی بیشترین استفاده رو در سرور های مبارزه و کامبت داره\n\n-» Vulcan\nیه آنتی چیت با قابلیت های زیاد و پولی . برای تمام چیت ها مناسب هست (ورژن های رلیس شده و کامل) و میشه گفت آنتی چیت خوبی هست\n\n-» Spartan\nاین آنتی چیت رو معمولا به سرور های سوروایول و اسکای بلاک میزنند ولی برای مبارزه هم میشه گفت خوبه.\n\n-» GodsEye\nیه آنتی چیت خوب برای سرور های اگوارز , بدوارز و سرور های مبارزه\nاین آنتی چیت خیلی شبیه آنتی چیت هایپیکسل هست طوری که چیت رو شناسایی میکنه ولی کاری با چیتر نداره و میزاره چیت بزنه . اگه مطمعن شد که طرف چیت هست اون رو بن میده\n\n-» Verus\nاین آنتی چیت مخصوص سرور های مبارزه هست و توصیه نمیشه که به سرور های بیلد بزنید .\nمعمولا چیت های AimBot یا Killaura رو سریع پیدا میکنه .\nبهترین ورژن برای استقاده از این آنتی چیت 1.8 و 1.12.2 هست\n\n💯 تمام آنتی چیت های معرفی شده پولی هستند و می تونید بخرید یا ورژن کرک یا لیک رو دانلود کنید", "by": "S4EeD_HD"}, "sjm": {"description": "» SimpleJoinMessages\nدیدید که وقتی وارد سرور میشید یه پیام میده ؟ میخوای عوض کنیش؟\nاینکار با پلاگین های دیگه امکان داره ولی این پلاگین ساپورت پلاگین معروف PlaceHolderAPI\nداره!\nقابلیت ها:\n- Join Message\n- Quit Message\n- First Join Message\n- Staff Join Message [Prefix]\n- Staff Quit Message [Prefix[\n- No Permission Message (reload Command)\n- Reload Message\n- Player Join Motd Message\n- Staff Join Motd Message\n- Fully Customizable\n- PlaceHolderAPI Support\n\nلینک : https://www.spigotmc.org/resources/90822/", "by": "PmzHero"}, "mcsoftwares": {"description": "Bukkit:\nپلاگین های ماینکرفت اول از همه با باکیت اومدن\nاوایل پلاگین های ساده ای بود که میشد استفاده کرد ولی الان بسیار پیشرفته شده\nبرای اطلاعات درباره پلاگین ها\n-info mna\n-info PmzHero\n\nولی در آینده فورک های بهتری مثل Spigot اومد که بهتر بود\nو سپس PaperMC که یک فورک اسپیگات بود و جالبه بدونید\nسازنده BungeeCord همون سازنده اسپیگات یا md_5 هست\nو سازنده های PaperMc همون بانجی رو مانند PaperMC به Waterfall تبدیل کردند که خیلی خوبه\nاستفاده از باکیت زیاد توسیعه نمیشه و از اسپیگات یا پیپر استفاده کنید\n\nDownload Bukkit : https://getbukkit.org/download/craftbukkit\nDownload Spigot : https://getbukkit.org/download/spigot\nDownload PaperMC : https://papermc.io/downloads#Paper-1.16\n------------------------------------------------------------------------\nProxies Mentioned in This topic:\nDownload BungeeCord : https://ci.md-5.net/job/BungeeCord/\nDownload Waterfall : https://papermc.io/downloads#Waterfall\n------------------------------------------------------------------------\nOther Proxies:\nDownload Travertine : https://papermc.io/downloads#Travertine\nDownload FlameCord : https://www.mc-market.org/resources/13492/\n------------------------------------------------------------------------\nNote: You Can Use The Plugins For BungeeCord That Dead_Light Mentioned In his Video", "by": "PmzHero"}, "<:baya:822188395597135872>": {"description": "<:Baya:822188395597135872>", "by": "PmzHero"}, "tas": {"description": "https://www.aparat.com/v/xbVsU", "by": "Dead_Light"}, "try": {"description": "https://www.aparat.com/v/xbVsU", "by": "Dead_Light"}, "tryandsee": {"description": "https://www.aparat.com/v/xbVsU", "by": "Dead_Light"}, "seyyed": {"description": "**Topics:**\n\n<:added:771442650611187742> TitleManager\n<:added:771442650611187742> PlayerKits\n<:added:771442650611187742> Znpc\n<:New_verified:771442682782154762> And More..", "by": "Seyyed68"}, "nametagedit": {"description": "💠 اگه می خواهید رنک بازیکن رو در تب نمایش دهید , چند روش وجود داره که یکی از این روش ها استفاده از پلاگین زیر می باشد\n❗ NameTagEdit ( نیم تگ ادیت )\n🗒️ حالا چطور میشه از این پلاگین استفاده کرد ؟\n🕹️  لیست ستوراتی که در این تاپیک یاد می گیرید:\n\n🔋 /nte group add <esm>:\nاین دستور برای اضافه کردن رنکتون به پلاگین هست\nکافیه بجای <esm> اسم رنک رو بزارید\n\n🔋 /nte group <rank> prefix <prefix>:\nبا این دستور میتونید حالت رنک موردنظرتون رو به پشت بازیکن ها تایین کنید\nکافیه بجای <prefix> حالت خودتون رو بزارید. مثل:\n'&8[&b&lOWN&8]&b '\n\n🔋 /nte group <rank> suffix <suffix>:\nاین دستور هم مثل دستور بالاس. با این تفاوت که این حالت رو به جولوی اسم بازیکن اضافه میکنه.\n\n🔋 /nte group <rank> permission <perm>:\nاین دستور پرمیشن لازم رو برای داشتن رنک تایین می کنه.\nیعنی اگر کسی پرمیشنی که شما معین میکنید رو داشته باشه اسم اون فرد توی تب حالت می گیره\n\n🔋 /nte group <rank> priotry <tartib>:\nاین دستور ترتیب رو در تب مشخص میکنه. ترتیب از 0 شروع میشه و 0 بالا ترین فرد توی تب میشه. همین طور که به عدد ترتیب اضافه میشه اون رنک توی تب پایین تر میره.\n\n🔋 /nte longtags:\nشاید بعضی وقت ها پیش بیاد که حالت تب بهم بخوره و اسم و رنک با هم قاطی شن. طوری که نه رنک ملوم شه ن اسم. معمولا با زدن این دستور این مشکل برطرف میشه.\n\n🔋 /nte reload:\nلود دوباره پلاکین\n\n❗آموزش نصب با لاکی پرمز:\nاین کار خیلی سادس. کافیه پرمیشن رنک تبتون رو به رنکتون توی لاک پرمز بدید و پلاگین رو لود دوباره کنید. مثال:\n/lp group <rank> permission set <permission>\n                  |    |    |\n                 \\         /\n                   \\     /\n                      --\n/lp group owner permission set nte.owner\nو لود دوباره:\n/nte reload", "by": "💻 ROOT"}, "programming": {"description": "🟣 تو این تاپیک قرارع چند تا سایت خفن برای یاد گیری برنامه نویسی معرفی کنیم <:noob50darsadi:824727723574034443> \n\n⭐ ➖ ➖ ➖ ➖ ➖ ⭐ \n1️⃣ \n\nایرانیان سایبر \n🍵 \nایران اسکرچ \n🥦 \nفرادرس \n<:wook:771442408251981825> \nکدرنجر \n🔷 \n<#834355365033672725> <:noob50darsadi:824727723574034443>", "by": "MNA"}, "npc": {"description": "به پیر و پیغمبر پلاگین citizens خودش قابلیت اضافه کردن کامند رو داره. پلاگین دیگه استفاده نکنید. :hey_hey:", "by": "Dead_Light"}, "search": {"description": "قبل از پرسیدن هر نوع ، گونه، شاخه؛ راسته، ... سوال اون رو گوگل کنیم !\n\nنحوه گوگل کردن:\n``-google google``\n\nمیلیون ها نفر قبل از شما این سوال رو پرسیدن <:Baya:822188395597135872> \n\n`` حکایت طنز و جالب از **اوستا** ممد قلی خان``", "by": "MNA"}}